# RemoveSingle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SelectionFilterElement..::..RemoveSingle Method
SelectionFilterElement Class See Also
---
Removes a single ElementId from the filter's set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void RemoveSingle(
	ElementId id
)
```

Visual Basic
---
```text
Public Sub RemoveSingle ( _
	id As ElementId _
)
```

Visual C++
---
```text
public:
void RemoveSingle(
	ElementId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementId The ElementId to remove.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Invalid ElementId |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
SelectionFilterElement Class
Autodesk.Revit.DB Namespace